---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPSystem..::..Remove Method
MEPSystem Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Remove(ConnectorSet) | Removes connectors from system. |
|  | Remove(ICollection<(Of <<'(ElementId>)>>)) | Remove elements from system. |

# See Also

MEPSystem Class

MEPSystem Members

Autodesk.Revit.DB Namespace